spec/cassettes/Create_payment_on_successful_charge/_creates_a_payment_with_the_webhook_from_stripe_for_charge_succeded_.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_14rxyWAQtNZoyYMJUgDdNISI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_nWghOIgECP61vAeNAyvebr68
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        doug-MS-7721 3.13.0-37-generic #64-Ubuntu SMP Mon Sep 22 21:28:38 UTC 2014
        x86_64 x86_64 x86_64 GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 27 Oct 2014 00:25:36 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1772'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 4c48783f-83a5-4b3e-b80b-72a53a9ff821
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_14rxyWAQtNZoyYMJUgDdNISI",
          "created": 1414356656,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_14rxyWAQtNZoyYMJYtqLJWpo",
              "object": "charge",
              "created": 1414356656,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_14rxyUAQtNZoyYMJRtsclxqZ",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 10,
                "exp_year": 2016,
                "fingerprint": "9jgXysEZroh2shiR",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5222Vc3jpmZtoi"
              },
              "captured": true,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_14rxyWAQtNZoyYMJYtqLJWpo/refunds",
                "data": []
              },
              "balance_transaction": "txn_14rxyWAQtNZoyYMJJgoucAWs",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_5222Vc3jpmZtoi",
              "invoice": "in_14rxyWAQtNZoyYMJG7qqHR7B",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": null,
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_5222h4oLuYmAAX"
        }
    http_version: 
  recorded_at: Mon, 27 Oct 2014 00:26:04 GMT
recorded_with: VCR 2.9.3
